"""1. Написати клас "Карточка на знижку" (DiscountCard), який містить наступну інформацію: 

Номер карточки 
Розмір знижки (знижка передбачається накопичуваною; на початковому етапі вона рівна 1%. За кожні 1000 грн. покупки, сума знижки збільшується на 1%.) 
Приховане допоміжне поле для збереження вартості накупленого товару 
Дата видачі карточки в форматі "12/02/1200") 
Забезпечити можливість: 
Купляти товар з використанням карточки на знижку; 
Виводити інформацію про поточну величину знижки; 
Виводити інформацію про те, на яку суму ще необхідно докупити товару, щоб величина знижки збільшилась. """

import datetime
from lib.DiscountCard import DiscountCard

card1 = DiscountCard()
print(card1.number, card1.sum, card1.discount, card1.date)

card1.buy_article(1000000)
# card1.buy_article(1500)
# card1.buy_article(1500)
print(card1.number, card1.sum, card1.discount, card1.date)

card1.discount_info()
card1.discount_inc_info()
